Tekla Open API Reference for Tekla Structures 2025
Symbol.GetObjects Method (Type[])
 Gets the children objects of the current object that are of certain types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetObjects(
	Type[] TypeFilter
)
Public Function GetObjects (
	TypeFilter As Type()
) As DrawingObjectEnumerator
Parameters
TypeFilter
Type: System.Type[]
The types of the objects to get.
Return Value
Type: DrawingObjectEnumerator
The children objects of the current object that are of certain types.
Implements
IHasChildren.GetObjects(Type[])
See Also
Reference
Symbol Class
GetObjects Overload
Tekla.Structures.Drawing Namespace